app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `username` = 'antho09'
 LIMIT 1
---
    public function attemptLogin()
    {
        $session = session();
        $model = new UsuarioModel();

        // 1. Validar los datos (puedes añadir reglas más estrictas)
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        if (empty($username) || empty($password)) {
            return redirect()->back()->with('error', 'Usuario y contraseña son requeridos.');
        }

        // 2. Buscar al usuario en la base de datos
        $user = $model->where('username', $username)->first();