app/Controllers/ProductosController.php

    public function index()
    {
        // ... (tu código del index) ...
        $model = new ProductoModel();
        $data = [
            'productos' => $model->findAll()
        ];
---
SELECT *
FROM `productos`

    public function create()
    {
        // Verificamos que sea una petición AJAX
        if ($this->request->isAJAX()) {

            $model = new ProductoModel();

            // Reglas de validación (puedes hacerlas más estrictas)
            $rules = [
                'nombre'       => 'required|min_length[3]|max_length[255]',
                'precio_venta' => 'required|decimal',
                'stock'        => 'required|integer',
            ];

            if (!$this->validate($rules)) {
                // Si la validación falla, devolvemos los errores
                return $this->response->setJSON(['success' => false, 'errors' => $this->validator->getErrors()]);
            }

            // Recogemos los datos del POST
            $data = [
                'codigo'        => $this->request->getPost('codigo'),
                'nombre'        => $this->request->getPost('nombre'),
                'precio_compra' => $this->request->getPost('precio_compra'),
                'precio_venta'  => $this->request->getPost('precio_venta'),
                'stock'         => $this->request->getPost('stock'),
            ];

            // Insertamos en la BD
            if ($model->insert($data)) {
---
INSERT INTO `productos` (`codigo`, `nombre`, `precio_compra`, `precio_venta`, `stock`) VALUES ('293792', 'Paneton', '12', '20', '20')

    public function edit($id = null)
    {
        if ($this->request->isAJAX()) {
            $model = new ProductoModel();
            $producto = $model->find($id);
---
SELECT *
FROM `productos`
WHERE `productos`.`id` = '1'

    public function delete($id = null)
    {
        if ($this->request->isAJAX()) {
            $model = new ProductoModel();

            if ($model->delete($id)) {
---
DELETE FROM `productos`
WHERE `id` IN ('1')